Revit 2024 API
FabricationPartSizeMap.ProfileType Property
 The shape of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.2
Syntax
C#
public ConnectorProfileType ProfileType { get; set; }
Visual Basic
Public Property ProfileType As ConnectorProfileType
	Get
	Set
Visual C++
public:
property ConnectorProfileType ProfileType {
	ConnectorProfileType get ();
	void set (ConnectorProfileType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace